Revit 2024 API
CircleLightShape Members
The CircleLightShape type exposes the following members.
Constructors
Name | Description
CircleLightShape()
 Creates a circle light shape object with 2.0' emit diameter.
CircleLightShape(Double)
 Creates a circle light shape object with the given emit diameter.
CircleLightShape(CircleLightShape)
 Creates a copy of the given circle light shape
Methods
Name | Description
Clone
 Creates a copy of the LightShape derived object.
 (Inherited from LightShape.)
Dispose |  (Inherited from LightShape.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
EmitDiameter
 The emit diameter.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from LightShape.)
See Also
CircleLightShape Class
Autodesk.Revit.DB.Lighting Namespace